//--------------------------------------------------------------
//野指针
//==============================================================
#include <iostream.h>
#include <string.h>

int main()
{
	char* p1 = new char[30];
	char* p2 = new char[30];
    //******************************
	strcpy(p1,"abcd");
	strcpy(p2,"1234");
	//********************************/
	//释放指针
	delete p1;//野指针 不安全的删除方法

	if(p2 != NULL)//正规的做法
	{
		delete p2;
		p2 = NULL;
	}

	cout<<"p1="<<&p1<<endl;
	cout<<"p2="<<&p2<<endl;
	
	return 0;
}
